package com.example.myapplicationkotlin

class Foods {

    companion object {
        fun getFoods(): List<Food> {
            return listOf(
                    getFood1(),
                    getFood2(),
                    getFood3(),
                    getFood4(),
                    getFood5(),
                    getFood6()

            )
        }
        private fun getFood1() = Food("Պիցցա թավայի վրա", "Պատրաստում ենք թթվասերի նման թույլ խմոր, \" +\n" +
                "            \"լցնում կարագով պատված թավայի մեջ և վերևից դնում ցանկացած միջուկ \" +\n" +
                "            \"(տոմատ, երշիկ, թթու վարունգ, զեյթուն, լոլիկ և այլն): Քսում ենք մայոնեզ \" +\n" +
                "            \"և վերևից ավելացնում քերած պանրի հաստ շերտ: Թավան մի \" +\n" +
                "            \"քանի րոպեով դնում ենք միջին կրակի վրա,\" +\n" +
                "            \" միանգամից փակում կափարիչը, հենց պանիրը սկսի հալչի` պիցցան պատրաստ է:", R.drawable.pizza1)

        private fun getFood2() = Food("ՊԻՑՑԱ ”DOUBLE CHEESE”", "Խմորը դնել տապակի վրա, եզրերը ձգել հավասարեցնել տապակի " +
                "ծայրերին: Վրան ցանել չորացրած սուսամբար: Պանիրը քերել: Հաստ շերտով փռել խմորի վրա: Օղակ-օղակ" +
                " կտրատել սալյամին, լոլիկը, սոխը: Շարել հերթականությամբ. Սալյամի, սոխ, լոլիկ: Կարևոր է, որ լոլիկը " +
                " վրա լինի և ոչ հակառակը: Վրան լցնում ենք կտրատած պղպեղը: " +
                "Ավելացնում ենք երկրորդ շերտ պանիրը: Թխում ենք տաք ձեռոցում 20-25 րոպե:", R.drawable.pizza2)
        private  fun getFood3()=Food("ՊԻՑՑԱ ԻՏԱԼԱԿԱՆ","Պիցցայի լոշին ձեթ քսել, մանր կտրատած կամ քերած պանիր ցանել," +
                " վրան կեղևը մաքրած և խոշոր բլթակներով կտրատված լոլիկի շերտ դնել: Սարդելկաները կտրատել երկարությամբ և ցանցաձև դասավորել վրան," +
                " աղ և պղպեղ ցանել և լցնել մնացած ձեթը: Թխել 30 րոպե:",R.drawable.pizza3)
        private  fun getFood4()=Food("ԿԱԼՑՈՆԵ. ԻՏԱԼԱԿԱՆ ՓԱԿ ՊԻՑՑԱ","Խմորիչը խառնել կաթի մեջ, " +
                "թողնել կես ժամ: Հետո ավելացնել աղը, շաքարավազը, բուսյաուղը, ալյուրը խառնել, խմոր հունցել: " +
                "Մոցարելա պանիրը օղակ-օղակ կտրատել, ապուխտը և վարունգը մանրացնել: Եթե ռոքֆոր է օգտագործվում, փոքրիկ կտորների վերածել:" +
                " Այս պանիրը հատուկ համ ունի: Բոլոր բաղադրիչները լցնել բացված խմորի մի կեսի վրա, վրան օրեգանո և հազրեվարդ ցանել," +
                " մի քանի ռեհանի տերև դնել: Խմորի կեսը բերել վրան և լուսնաձև փակել: Ստացվում է չեբուրեկի պես խմոր: Տոմատը խառնել " +
                "երկու գդալ ձիթապտղի յուղի հետ, քսել պիցցայիերեսին, վրան օրեգանո և հազրեվարդ ցանել:" +
                " Թխել 200 աստիճանի տակ 10 րոպե, մինչև կարմրի: Կարելի է մատուցել թե տաք, թե սառը:",R.drawable.pizza4)
        private  fun getFood5()=Food("Պիցցա Վենետիկյան","Ալյուրը մաղել, ձուն վրան կոտրել, ավելացնել կաթը: " +
                "Հարել, այնքան ալյուր լցնել, որ կպչուն խմոր դառա:\n" +
                "Խմորը գունդ անել, դնել թաց սրբիչի վրա, թողնել մի որոշ ժամանակով:" +
                " Հետո բացել տապակի չափով: Ավելորդ մասերը կտրել: Խմորի վրա շարել լոլիկի և " +
                "երշիկի բարակ շերտերը: Վրան պղպեղ և քերած պանիր ցանել:" +
                " Դնել 220°С ջեռոցը 20 րոպե: Թեթևակի սառեցնել և մատուցել:",R.drawable.pizza5)
        private  fun getFood6()=Food("Արքայական պիցցա","Խմորը տեղադրել յուղած տապակի վրա: " +
                "Լոլիկները կեղևահան անել, օղակ-օղակ կտրել: Ապուխտը կտրատել բարակ ձողիկներով: Խմորի վրա" +
                " շերտերով դնել լոլիկներն ու ապուխտը:" +
                " Վրան դնել ձիթապտուղները, պղպեղ և քերած պանիր ցանել: Թխել ջեռոցի մեջ մոտ 35 րոպե:",R.drawable.pizza6)
    }

    /*const val DESCREPTION = "Պատրաստում ենք թթվասերի նման թույլ խմոր, " +
            "լցնում կարագով պատված թավայի մեջ և վերևից դնում ցանկացած միջուկ " +
            "(տոմատ, երշիկ, թթու վարունգ, զեյթուն, լոլիկ և այլն): Քսում ենք մայոնեզ " +
            "և վերևից ավելացնում քերած պանրի հաստ շերտ: Թավան մի " +
            "քանի րոպեով դնում ենք միջին կրակի վրա," +
            " միանգամից փակում կափարիչը, հենց պանիրը սկսի հալչի` պիցցան պատրաստ է:"*/
}